class OnlineGoods:
    __discounts = (0, 0.01, 0.05, 0.1, 0.2)

    def __init__(self, price):
        self.__price = price
        self.__discount = self.__discounts[0]

    def calculate_price(self):
        return self.__price * (1 - self.__discount)

    def set_discount(self, discount_code):
        if 1 <= discount_code <= 5:
            self.__discount = self.__discounts[discount_code - 1]
        else:
            print("Невірний код знижки. Введіть від 1 до 5.")

    @property
    def base_price(self):
        return self.__price

    @base_price.setter
    def base_price(self, new_price):
        if isinstance(new_price, (int, float)):
            if isinstance(new_price, float) and len(str(new_price).split('.')[-1]) > 2:
                print("Невірна ціна, ціна повинна мати 2 числа після коми")
            elif new_price > 0:
                self.__price = new_price
            else:
                print("Невірна ціна. Ціна повинна бути плюсовим числом")
        else:
            print("Невірна ціна. Ціна повинна бути цифрою.")
# Клас OnlineGoods представляє інтернет-товар і має ряд функцій для керування ціною та знижками на товар. Основні елементи класу включають приватні атрибути __price (базова ціна товару) та __discount (поточна знижка), а також статичний приватний атрибут __discounts (кортеж із значеннями знижок).
# Метод __init__ встановлює значення __price і __discount. __price приймається як аргумент конструктора, а __discount отримує перше значення з кортежа __discounts (0). Цей метод викликається при створенні нового екземпляра класу.
# Метод calculate_price використовується для обчислення ціни товару з урахуванням поточної знижки. Він повертає результат обчислення __price * (1 - __discount).
# Метод set_discount встановлює поточну знижку на товар на основі переданого коду знижки. Якщо код знижки є допустимим числом від 1 до 5, метод встановлює відповідне значення знижки з кортежа __discounts. У протилежному випадку виводиться повідомлення про недійсний код знижки.
# Властивість base_price дозволяє зчитувати та змінювати базову ціну товару. Вона має getter та setter. Getter повертає значення __price, а setter перевіряє нову ціну на відповідність вимогам. Якщо нова ціна є цілим додатнім числом або дійсним числом з не більш ніж двома знаками після крапки, вона встановлюється як нове значення __price. У протилежному випадку виводиться повідомлення про неправильну ціну.
# У класі також використовується індексація кортежа для отримання поточного значення знижки на основі коду знижки. Знижки зберігаються в кортежі __discounts і доступні для всіх екземплярів класу